In [1]:
import pandas as pd

In [7]:
us_babies= pd.read_csv('us_baby_names.csv')

In [8]:
us_babies.head()

   Id       Name  Year Gender  Count
0   1       Mary  1880      F   7065
1   2       Anna  1880      F   2604
2   3       Emma  1880      F   2003
3   4  Elizabeth  1880      F   1939
4   5     Minnie  1880      F   1746

### Manipulating a  DataFrame

In [9]:
#what were the 5 most popular baby names in 2014 in US?
'''
    Approach:
    slice out rows for 2014
    Sort rows in descending order by count
'''
#extract the year column
us_babies['Year']

0          1880
1          1880
2          1880
3          1880
4          1880
           ...
1825428    2014
1825429    2014
1825430    2014
1825431    2014
1825432    2014
Name: Year, Length: 1825433, dtype: int64

In [10]:
#slice out rows for 2014
us_babies['Year'] == 2014

0          False
1          False
2          False
3          False
4          False
           ...
1825428     True
1825429     True
1825430     True
1825431     True
1825432     True
Name: Year, Length: 1825433, dtype: bool

In [11]:
#loc method allow to access a specific group of rows and columns from a pandas data frame.
us_babies_2014 = us_babies.loc[us_babies['Year']==2014, :]

In [12]:
us_babies_2014

              Id      Name  Year Gender  Count
1792389  1792390      Emma  2014      F  20799
1792390  1792391    Olivia  2014      F  19674
1792391  1792392    Sophia  2014      F  18490
1792392  1792393  Isabella  2014      F  16950
1792393  1792394       Ava  2014      F  15586
...          ...       ...   ...    ...    ...
1825428  1825429    Zykeem  2014      M      5
1825429  1825430    Zymeer  2014      M      5
1825430  1825431   Zymiere  2014      M      5
1825431  1825432     Zyran  2014      M      5
1825432  1825433     Zyrin  2014      M      5

[33044 rows x 5 columns]

In [16]:
#sort the rows in descending order by count
#this will result in a new data frame which is set to sorted_us_2014
sorted_us_2014 = us_babies_2014.sort_values('Count',ascending =False)

In [17]:
sorted_us_2014

              Id    Name  Year Gender  Count
1792389  1792390    Emma  2014      F  20799
1792390  1792391  Olivia  2014      F  19674
1811456  1811457    Noah  2014      M  19144
1792391  1792392  Sophia  2014      F  18490
1811457  1811458    Liam  2014      M  18342
...          ...     ...   ...    ...    ...
1810561  1810562   Melba  2014      F      5
1810560  1810561  Melaya  2014      F      5
1810559  1810560     Mel  2014      F      5
1810558  1810559   Mekhi  2014      F      5
1825432  1825433   Zyrin  2014      M      5

[33044 rows x 5 columns]

### slice out the first 5 rows using iloc method

In [18]:
# it takes in a numerical value as input.
sorted_us_2014.iloc[0:5]

              Id    Name  Year Gender  Count
1792389  1792390    Emma  2014      F  20799
1792390  1792391  Olivia  2014      F  19674
1811456  1811457    Noah  2014      M  19144
1792391  1792392  Sophia  2014      F  18490
1811457  1811458    Liam  2014      M  18342

This means the table shown above represents the first 5 most popular baby names in 2014

# Data Cleaning

In [19]:
'''
making data conducive for analysis. 
can also be used to detect and fix corrupt data.

used to fix:
    missing values
    misspellings
    duplicate rows
    inconsistence formats
    structure of overall data
    extracting information from complex value
    unspecified units conversions
    interpretation of magnitudes
'''

'\nmaking data conducive for analysis. \ncan also be used to detect and fix corrupt data.\n\nused to fix:\n    missing values\n    misspellings\n    duplicate rows\n    inconsistence formats\n    structure of overall data\n    extracting information from complex value\n    unspecified units conversions\n    interpretation of magnitudes\n'

In [20]:
'''
When Cleaning Data you should look for:
    Missing Values
    Misspellings
    Duplicate rows
    Inconsistence format
'''

'\nWhen Cleaning Data you should look for:\n    Missing Values\n    Misspellings\n    Duplicate rows\n    Inconsistence format\n'